[
    {
        "href": "/wiki/Jutsu",
        "title": "Jutsu",
        "data": [
            "Jutsu (術, Literally meaning: skills/techniques) are the mystical arts a ninja will utilise in battle. To use a technique, the ninja will need to use their chakra. To perform a technique, the ninja will bring out and release the two energies of chakra. By forming hand seals, the ninja is able to manifest the desired technique. Because of the extensive number of hand seals and different combinations, there are thousands of potential techniques to be discovered.\n",
            "There are three basic types of techniques: ninjutsu, genjutsu and taijutsu. Subcategories exist, including fūinjutsu, juinjutsu and senjutsu. There are also kekkei genkai abilities which aren't techniques, but inherited abilities passed down through certain clans (however, they can be used as base for certain techniques, such as Haku's Demonic Mirroring Ice Crystals). Kekkei genkai can also be attributed to certain parts of the body, such as dōjutsu.\n",
            "Without proper control of their chakra, a ninja will produce ineffective or weakened technique which will lead to them running out of chakra early in a fight. To manipulate their chakra more easily, hand seals can be used. With these hand seals, users can control their chakra and technique with higher efficiency. Different techniques require different hand seals.\n",
            "Depending on the difficulty or skill necessary to perform a technique, they are ranked differently. There are six different ranks in techniques:\n",
            "Kekkei Genkai and unique abilities normally do not have a rank.\n",
            "The groups who possess these techniques are usually extremely secretive about them in order to ensure that no one other than the members of the group or clan learns them. As such, they are passed down through oral means instead of being written down or recorded. A few hiden techniques require a special ability or lineage and as such are usually the pride and fame of the clan that possesses them.\n",
            "\n"
        ]
    },
    {
        "href": "/wiki/Barrier_Ninjutsu",
        "title": "Barrier Ninjutsu",
        "data": [
            "Barrier Ninjutsu (結界忍術, Kekkai Ninjutsu, Literally meaning: Barrier Ninja Techniques) is the incorporation of barriers into techniques. Essentially these techniques allow the users to manipulate barriers. The user can erect barriers that can be used to protect themselves, or to trap an opponent, amongst other various uses.\n",
            "There are also several species of animals that make use of barrier techniques such as the Gourd Toad of Mount Myōboku which utilises the Barrier: Toad Gourd Prison. Barriers have also been incorporated into the form of tags for both offensive and defensive purposes.\n",
            "Barriers can be used for a variety of purposes, such as to prevent outsiders from entering, as with the Five-Seal Barrier; to prevent those inside from leaving the confines of the barrier, and even to prevent those trapped within from using certain techniques, as was done to stop Dan Katō from utilising the Spirit Transformation Technique by erecting the Four Violet Flames Formation around him.\n",
            "The strength and efficiency of barriers seemingly depends on the type of technique used to create the barrier itself, and the ability of others to perceive, enter, or destroy the barrier. The Self-Repairing Barrier, created by a synchronised array of multiple shinobi, is supposedly able to contain a jinchūriki and its tailed beast, but has been shown to be unable to handle the combined efforts of two jinchūriki from breaking out. The Four Red Yang Formation a powerful barrier only usable by four Kage-calibre shinobi. The Six Red Yang Formation is the highest level barrier in existence, usable only by those who possess both the Six Paths Power and the Rinnegan.[1]\n",
            "Some Barrier Ninjutsu seems to have a tie-in with Space–Time Ninjutsu, by manipulating the very barrier of space-time continuum itself: examples include the inside of the Toad Gourd Prison, that is a barrier of a different world, while Kamui transfers the target to the other dimension and the Flying Thunder God: Guiding Thunder warps the target to another kunai's location.\n",
            "Although barriers are meant to contain an area from outsiders from entering or vice-versa, they can be breached in different manners. For certain barriers, users can willingly create openings for people to pass through,[2] or if others know a certain hand seal to temporarily open a barrier without dispelling it, such as Deidara opening the Five-Seal Barrier or Itachi Uchiha allowed himself and Kisame Hoshigaki to slip through the Sensing Barrier.\n",
            "Some barriers can be broken by sheer force, as Kakuzu punched through the Sealed Iron Wall or Obito Uchiha tore through the Four Red Yang Formation. This depends on the strength of the attack in proportion to the field.\n",
            "Disregarding the strength of any barrier, even the most powerful ones, intended to prevent detection and/or intrusion by outsiders, they can be circumvented by the use of Space–Time Ninjutsu, because barriers only create confines within the dimension that they reside in, in which Space–Time Ninjutsu can bypass them by going into another dimension. Primary examples seen are when Obito's Kamui, which he used to gain access to the place where Kushina Uzumaki was giving birth to Naruto Uzumaki,[3][4] or when Minato Namikaze used the Flying Thunder God Technique to teleport a large amount of people out of Obito's Six Red Yang Formation's otherwise inescapable boundaries.[5]\n"
        ]
    },
    {
        "href": "/wiki/Bukijutsu",
        "title": "Bukijutsu",
        "data": [
            "A ninja's use of weaponry in combat is known as \"bukijutsu\" (武器術, Literally meaning: Weapon Techniques). All ninja use a weapon at some point in their careers, but not all do so regularly.\n",
            "Weapons can be just as useful on the battlefield as any other jutsu in a ninja's arsenal, either due to the weapon's design, its special abilities, or the unique way in which a ninja combines it with his or her other skills; ninja frequently coat their weapons with their chakra to alter the weapon's properties, a process called chakra flow. Over time, a particular weapon or set of weapons may gain its own fame for one reason or another, as with the Treasured Tools of the Sage of Six Paths. Weapons of all types, whether common or rare, are frequently sealed within scrolls or some other flat surface for ease of transport and accessibility in combat.\n",
            "To be able to create new and powerful weapons makes one prized to one's village, allies, or customers; in the anime, the Takumi Village was once the world's top provider of ninja weaponry.\n",
            "Some types of weapons are used often enough in Naruto to be considered a specialised discipline within the broader \"bukijutsu\" classification:\n"
        ]
    },
    {
        "href": "/wiki/Chakra_Absorption_Techniques",
        "title": "Chakra Absorption Techniques",
        "data": [
            "Chakra absorption techniques (チャクラ吸引術, Chakura Kyūin Jutsu, English TV: Chakra Absorption Jutsu) allow the user to absorb the chakra of another individual - usually an opponent's - and utilise it as if it were their own. Those who have had their chakra absorbed have reduced options in combat due to the lost chakra, and if enough chakra is taken they may be too weak to move.[1] Conversely, those who have absorbed the chakra have expanded combat options due to the increased chakra reserves and their physical condition may improve as a result.[2] However, users must be able to process the chakra they absorb; if they absorb senjutsu-chakra but do not have the required training in senjutsu, they will turn to stone.[3]\n",
            "When absorbing another's chakra, most ninja require some medium through which to do so, whether it be a jutsu (as in several Wood Release techniques), a weapon (notably Samehada and the anime's Infinite Armour), or some other resource (as in the Aburame clan's kikaichū). Others are able to absorb chakra simply by making physical contact with a target. Known individuals that can do so are: Yoroi Akadō,[4] Jirōbō,[5] Kisame Hoshigaki,[6] White Zetsu,[7] Black Zetsu,[8] Madara Uchiha,[9] Obito Uchiha,[10]  Fūka,[11] and the Ultimate Summoning Beast.[12] Orochimaru is shown absorbing only his own chakra from Kabuto Yakushi,[13] so it's unclear if he can absorb any target's chakra if he so chooses.\n"
        ]
    },
    {
        "href": "/wiki/Chakra_Flow",
        "title": "Chakra Flow",
        "data": [
            "Chakra Flow (チャクラ流し, Chakura Nagashi) refers to both the flowing of chakra through an object as well as any technique that increases the potency of a weapon by flowing chakra through it. Ordinarily, elemental chakra is used to flow through bladed weapons in order to either, dramatically increase their various pre-existing properties, or to gain additional advantageous effects. Usually, the user must be touching the tool to initiate chakra flow but not always as with the Fire Release: Phoenix Sage Flower Nail Crimson technique, and direct contact with the weapon is not necessary to maintain chakra flow. Similarly, techniques such as Kakuzu's Earth Release: Earth Spear, Rōshi's Lava Release Chakra Mode and the Fourth Raikage's Lightning Release Chakra Mode are used to increase close-quarter combat offence and defence by flowing chakra directly through the user's body. However, whether through an individual's body or weapon, the exact effects observed are entirely dependent upon the respective nature and amount of the chakra used.\n",
            "The known variations of chakra utilised include:\n",
            "Asuma Sarutobi carried special Chakra Blades that were fabricated from a material that absorbed chakra easier, in order to more effectively create these unique effects, which later fell into the possession of his student, Shikamaru. Asuma's daughter Mirai eventually uses the same weapon. Asuma also taught Naruto Uzumaki the basics of this technique.\n"
        ]
    },
    {
        "href": "/wiki/Clone_Techniques",
        "title": "Clone Techniques",
        "data": [
            "Clone Techniques (分身術, Bunshinjutsu) are techniques that create copies of the user or their tools. Though the standard Clone Technique is considered the most basic of ninjutsu, these techniques are highly versatile, often used to distract enemies or fool them into thinking they have landed a hit on the user. Corporeal clones can aid the user in physical combat, and even use techniques independent of the original. There are varying methods of creating clones, some techniques using only chakra while others require some sort of medium to give the clones form and substance. There are also clone techniques that transform another person or animal into a clone of the user, such as the Beast Human Clone, as well as genjutsu which create illusory clones, such as the Mist Servant Technique.[1]\n",
            "Clone techniques can also be applied to material objects, such as the Shuriken Shadow Clone Technique. However, such a feat is on a far higher level than using the technique on oneself.[2]\n",
            "Clones have been noted several times to be reduced in quality from the original in some way, shape, or form. Madara boasted that clones are useless against him and Obito mentioned the chakra received from a clone could not supply him the chakra he needed to use Kamui to sync with Kaguya's dimensions.\n",
            "During his experiments on Shin Uchiha, Orochimaru developed a variant of clones, which were considered to be a higher class than the Shadow Clone Technique. The results are that each one is the same as the original, and that they will not disappear even if struck with sufficient force; the only method of dispersal is killing them.[3] In a way, they are similar to White Zetsu's Parasite Clone, though unlike them, they have their own sense of individuality and free will, leading them to betray the original Shin when they see fit. These clones have also created their own clones without the original noticing, but had done so improperly, which resulted in various genetic and physical defects. Regardless, since they are not bound by the original nor can be dispersed like a normal technique, they are essentially separate, living individuals.[4] Orochimaru later applied this to create partial clones of himself, Log and Mitsuki.\n",
            "Other individuals have also created various types of clones, whether they are based off of Orochimaru's methods or independently:\n"
        ]
    },
    {
        "href": "/wiki/Cooperation_Ninjutsu",
        "title": "Cooperation Ninjutsu",
        "data": [
            "Cooperation ninjutsu (連携忍術, Renkei Ninjutsu), called collaboration techniques (コンビ術, Konbijutsu, English TV: collaboration jutsu) in the anime, is the combination of two or more jutsu to create a new jutsu with a strength greater than the sum of its components. This \"strength\" can be measured in terms of the new jutsu's range or destructive power. \n",
            "Cooperation ninjutsu are little-explored in the series. Although there are numerous of examples of characters working together and/or jutsu being performed in combination, Kiba Inuzuka's partnership with Akamaru being a prime example, these are never labelled \"cooperation ninjutsu\" and do not seem to exactly fit the definition. The few explicit examples are typically combinations of nature transformations, where one nature is used to make another nature even stronger, such as the Scorch Release: Halo Hurricane Jet Black Arrow Style Zero, a combination of fire and wind.\n",
            "The anime explores cooperation ninjutsu during the Three-Tails' Appearance. During the arc, Jiraiya states that cooperation ninjutsu requires synchronisation between those whose jutsu are being combined. This synchronisation can be achieved either through familiarity with each other or simple like-mindedness. For example, because both Naruto Uzumaki and Gamatatsu are \"simple\", they are ideal collaboration partners.\n"
        ]
    },
    {
        "href": "/wiki/D%C5%8Djutsu",
        "title": "Dōjutsu",
        "data": [
            "Dōjutsu (瞳術, English TV: Visual Jutsu, Literally meaning: Eye Techniques) are ninja abilities that utilise the eyes, a by-product of specific kekkei genkai or kekkei mōra. The word refers to both the eyes themselves, which have a number of passive abilities, and any jutsu dependent on the eyes to be performed; the former requires little to no chakra to be used, while the latter varies depending on the technique. Dōjutsu can be transplanted into others, though use of the dōjutsu is typically more limited or taxing for those without a genetic predisposition for it.[1] While the user's eyes can be overused and dōjutsu can be prevented from being accessed for a period of time, it doesn't mean the user will be exhausted and they can still use other techniques. Of all the known dōjutsu, the Byakugan, Rinnegan, and Sharingan are collectively known as the Three Great Dōjutsu (三大瞳術, San Daidōjutsu, English TV: Three Great Visual Jutsu, Literally meaning: Three Great Eye Techniques).[2]\n",
            "\n",
            "In Naruto Shippūden the Movie, Shion has a dōjutsu that allows her to see a select person's future. Usually this activated involuntarily to show her the person's eventual death. When activated, her eyes change into a violet, ornate, pupil.\n",
            "Yome has a dōjutsu that allows her to dilate her pupils and track down enemies via the reflection of tiny water droplets. Yome can also use this ability to augment her evasion-skills during combat.\n",
            "Isshiki Ōtsutsuki has a dōjutsu that allows him to store anything that has shrunk using Sukunahikona in a dimension where time doesn't flow, allowing them to maintain a pristine condition. They can be instantaneously retrieved and enlarged at the focus of his gaze.\n",
            "The concept of dōjutsu may have been inspired by Futaro Yamada's 1959 novel, The Kōga Ninja Scrolls (甲賀忍法帖, Kōga Ninpōchō), which featured two warring clans of ninja that had developed mutations and abilities through selective breeding, with the young heirs to each clan possessing mysterious dōjutsu.\n",
            "Another possible inspiration for dōjutsu in the series may also be found in the Journey to the West classic's titular character, the Monkey God-King, Sun Wukong: After having eaten all of the 'peaches of immortality', the 'pills of longevity' and drunk all of the 'wine of immortality', and then was captured after a long rebellion against Heaven, the Monkey God-King, Sun Wukong, was then sealed into Lao Tzu's Eight Trigram furnace to be burned to ash in order for Lao Tzu to reclaim his pills of longevity. But after 49 days, Sun Wukong broke out--stronger than ever--his body having been refined by the flames instead of being reduced to ash. His eyes had also become a fiery red and golden colour, becoming known as his \"Fiery-eyes golden-gaze\" (火眼金睛, Huǒyǎn-Jīnjīng); an eye condition that allowed Sun Wukong to now see what's really there just by looking and the ability to see and recognise the real form of evil despite whatever form that it took on — but, likewise, it also gave him a weakness to smoke, fogging his vision.\n"
        ]
    },
    {
        "href": "/wiki/F%C5%ABinjutsu",
        "title": "Fūinjutsu",
        "data": [
            "Fūinjutsu (封印術, English TV: Sealing Jutsu, Literally meaning: Sealing Techniques) are a type of jutsu that seal objects, living beings, chakra, along with a wide variety of other things within another object. Fūinjutsu can also be used to restrict movement or unseal objects either from within something or someone.\n",
            "The presence of a seal is marked by the appearance of formations of technique formulae, kanji, or else other kinds of symbols (likewise with Summoning Techniques).\n",
            "A unison of barrier ninjutsu and fūinjutsu is referred to as a \"Sealing Barrier\" (封印結界, Fūin Kekkai).\n",
            "In a similar fashion to genjutsu, fūinjutsu can be undone by combining specific seals with a Fūinjutsu: Release (封印術・解, Fūinjutsu: Kai, Literally meaning: Sealing Technique: Release) command.[1]\n"
        ]
    },
    {
        "href": "/wiki/Genjutsu",
        "title": "Genjutsu",
        "data": [
            "Genjutsu (幻術, Literally meaning: Illusionary Techniques) is one of the main jutsu categories which uses chakra. Unlike ninjutsu, the effects of genjutsu are not real, being only sensory illusions experienced by those who fall victim to it. According to the Second Mizukage, genjutsu falls under the broad category of Yin Release.[1]\n",
            "A genjutsu is created when a ninja controls the chakra flow of a target's cerebral nervous system, thereby affecting their five senses; this is frequently used to create false images and/or trick the body into believing its has experienced physical pain. It is further explained in the anime that, because genjutsu affects activity throughout the prosencephalon structure of the brain, humans, dogs and other species of mammal are therefore all affected by genjutsu; however, the kikaichū, like all insects, lack such a structure to their brains, and so do not even notice it: as Shino Aburame put it, insects are ruled almost solely by their senses alone, which makes them immune to genjutsu and gives the Aburame clan an ability to detect it, even when heightened senses become succeptible.[2]\n",
            "Genjutsu can also be used to manipulate others - similar to brainwashing - by feeding the victim illusive suggestions. Methods include integration with nature transformation, as shown with Water and Lightning Release, and in the anime, ingesting special pills that activate when the target sleeps.[3] Audible genjutsu is deemed the most dangerous because the user can trap victims from long distances.[4]\n",
            "Despite its usefulness, genjutsu is rarely employed, most shinobi preferring the real, tangible effects of ninjutsu and taijutsu over the imagined effects of genjutsu. The difficulty of performing genjutsu in the first place presents an additional barrier to its use: genjutsu require precise chakra control in order to manipulate the target's senses and advanced intelligence to make the illusion convincing,[5] prerequisites that even someone as skilled as Jiraiya lacks.[6] Some, however, are able to specialise in genjutsu, with Kurenai Yūhi being regarded as one of Konoha's experts in the field and members of the Uchiha clan being particularly feared because of their Sharingan's generic genjutsu. According to Hagoromo, the Byakugan can also be used to extend the range of genjutsu.\n",
            "Those under the influence of genjutsu will either appear to be unconscious or continue to move around under the pretence of the genjutsu. The latter is very effective in battle as a genjutsu user can make themselves appear to be somewhere else and attack the victim from behind or change the environment to make the victim see a flat plain where there is a steep cliff. Alternatively, a genjutsu user can create relatively small differences in the environment, which is more effective for intel gathering. For example, Itachi Uchiha was known to cast a genjutsu upon meeting someone, and that person's reaction to Itachi's image in the genjutsu would help him understand them better while keeping himself safe.\n",
            "There are several options to combat genjutsu:\n"
        ]
    },
    {
        "href": "/wiki/Hiden",
        "title": "Hiden",
        "data": [
            "Hiden (秘伝, Literally meaning: secret tradition) or simply \"secret\" techniques are passed down from generation to generation in certain regions or clans.\n",
            "The groups who possess these techniques are usually extremely secretive about them in order to ensure that no one other than the members of the group or clan learns them. As such, they are passed down through oral means instead of being written down or recorded. A few hiden techniques require a special ability or lineage and as such are usually the pride and fame of the clan that possesses them. \n",
            "Many hiden techniques are rooted in Yin or Yang Release such as the Nara clan's Shadow Imitation Technique, or, the Akimichi clan's Multi-Size Technique respectively. These techniques cannot be copied through simple observation, however, they are not to be confused with kekkei genkai, as technically, hiden techniques can be taught to anyone.\n"
        ]
    },
    {
        "href": "/wiki/Juinjutsu",
        "title": "Juinjutsu",
        "data": [
            "Juinjutsu (呪印術, Viz: Curse Mark Jutsu, Literally meaning: Cursed Seal Techniques) are a type of techniques used to bring someone under the control of the user. By applying a seal to the victim's body, the user brings the victim's abilities and actions under their control. With a simple secret hand seal, the user can inflict great mental and physical torment on the victim. The exact workings of juinjutsu are kept secret.\n"
        ]
    },
    {
        "href": "/wiki/Jujutsu",
        "title": "Jujutsu",
        "data": [
            "Jujutsu (呪術, Viz: Curse Jutsu, Literally meaning: Curse Technique) are a type of techniques that harm the enemy by cursing them. They work similar to juinjutsu, however, the user doesn't have to apply a seal on the enemy to curse them.\n",
            "The two named techniques of this type are Hidan's Curse Technique: Death Controlling Possessed Blood and Ryūki's Curse Technique: Body Controlling Manipulated Blood, where both requires the enemy's blood to curse the victim. In The Last: Naruto the Movie, an unnamed jujutsu was applied to the Tenseigan orb, making it impossible to be destroyed by anyone not part of Hamura Ōtsutsuki's lineage, instead draining them of their chakra. Mitsuki is noted to be skilled in jujutsu.\n"
        ]
    },
    {
        "href": "/wiki/Kekkei_Genkai",
        "title": "Kekkei Genkai",
        "data": [
            "A kekkei genkai (血継限界, Literally meaning: Bloodline Limit) is an anomaly of the DNA that allows the wielder to use unique techniques. A kekkei genkai's name describes both the anomaly and the resulting technique. Most kekkei genkai are passed down between generations of a clan, an exception being Hashirama Senju's Wood Release. Likewise, most individuals only inherit one kekkei genkai, but Mei Terumī is known to naturally possess two.\n",
            "Generally speaking, there are three types of kekkei genkai:\n",
            "Kekkei genkai make their users far more powerful than the average shinobi. In times of war they are deadly on the battlefield, and are often deployed to turn the tide of the battle. They are highly effective in this regard, but this tends to create issues for them after the conflict is over: survivors of the battle that witnessed or that lost loved ones to kekkei genkai users come to fear and hate them for their actions. They are persecuted because of their abilities, forcing them to the lower rungs of society or driving them into hiding. Even the villages that employ them may stigmatise them, relying on them in combat situations but being unconcerned with their actual survival.\n",
            "Even though individuals with kekkei genkai are mistreated, the actual kekkei genkai remain coveted by many. Kumogakure, for example, has made different attempts to steal the Byakugan. The Hyūga clan has taken steps to preserve the secret of the Byakugan, first by obligating members of its branch families to sacrifice their lives for members of its main family, and furthermore by branding branch members in order to destroy their Byakugan when they die. Despite these safeguards, Ao of Kirigakure was able obtain a Byakugan, and he goes to great lengths to ensure it cannot be taken back.\n",
            "When attempting to transfer kekkei genkai to others, dōjutsu are the easiest to work with; the recipient merely needs to be implanted with it. If the recipient does not have a genetic predisposition for the dōjutsu, using it will demand far more chakra than is required for natural users. For nature transformation kekkei genkai, only Hashirama Senju's Wood Release has been shown trying to be recreated in others: Orochimaru attempted to reproduce Wood Release by modifying tests subjects' DNA, succeeding only with Yamato;[1] Kabuto Yakushi perfected grafts of Hashirama that could be implanted in others, granting them Wood Release; Madara Uchiha developed a substance that, when used for artificial limbs, allows limited Wood Release usage. For bodily kekkei genkai, transferring or reproducing them appears to be prohibitively difficult: to acquire Kimimaro's Shikotsumyaku, Orochimaru planned to simply take over Kimimaro's body, a plan he had to abandon when Kimimaro's body was discovered to be dying.\n",
            "If an individual cannot gain access to a kekkei genkai directly, they can try instead to use it through the kekkei genkai's original user. Sasori could access the Third Kazekage's Magnet Release via a human puppet made from the Kazekage's body. Orochimaru and Kabuto use the Impure World Reincarnation to revive the dead – complete with any kekkei genkai they possessed during life – which are fully under their control. Kabuto also develops a method of creating mindless copies of kekkei genkai users which he generates as needed.[2]\n",
            "\n",
            "The concept of special ninja techniques limited by bloodline inheritance may have been inspired in part by the works of Futaro Yamada, which strongly influenced later depictions of ninja in fiction. In particular, The Kōga Ninja Scrolls (甲賀忍法帖, Kōga Ninpōchō), published in 1959, featured a pair of warring ninja clans that, through selective breeding, had produced ninja with a variety of deformities, mutations, and special abilities, even dōjutsu.\n"
        ]
    },
    {
        "href": "/wiki/Kekkei_M%C5%8Dra",
        "title": "Kekkei Mōra",
        "data": [
            "Kekkei Mōra (血継網羅, Literally meaning: Bloodline Encompassing) is an advanced branch of jutsu unique to Kaguya Ōtsutsuki and her direct bloodline. All of Kaguya's techniques were classified as kekkei mōra; beyond these examples, what exactly classifies a kekkei mōra is unknown. What can be determined, however, is that it does not strictly follow the same guidelines as a kekkei genkai or kekkei tōta, for instance: only Kaguya's Byakugan and Hagoromo's Rinnegan are classified as a kekkei mōra, while all others are kekkei genkai.\n",
            "\n"
        ]
    },
    {
        "href": "/wiki/Kekkei_T%C5%8Dta",
        "title": "Kekkei Tōta",
        "data": [
            "Kekkei Tōta (血継淘汰, Literally meaning: Bloodline Selection) is an advanced branch of jutsu that is more advanced than the jutsu class of kekkei genkai.[1] The only known example is Dust Release, a combination of three different nature transformations — earth, wind, and fire. \n",
            "\n"
        ]
    },
    {
        "href": "/wiki/Kenjutsu",
        "title": "Kenjutsu",
        "data": [
            "Kenjutsu (剣術, Literally meaning: Sword Technique) pertains to techniques that entail the use of swords, whether the users be shinobi, or samurai. Kenjutsu can be used in combination with taijutsu, ninjutsu, fūinjutsu, chakra flow and even genjutsu in order to achieve more devastating techniques. It is regarded as a branch of bukijutsu.\n",
            "The entire military might of the lone samurai nation of the Land of Iron have all been depicted as practitioners of kenjutsu. Some shinobi villages seem to promote the use of kenjutsu as well, such as Kumogakure,[1] and due to the tradition of the Seven Ninja Swordsmen of the Mist, every single Kirigakure villager strives to master kenjutsu from their childhood onwards.[2]\n"
        ]
    },
    {
        "href": "/wiki/Kinjutsu",
        "title": "Kinjutsu",
        "data": [
            "Kinjutsu (禁術, Literally meaning: Forbidden Techniques) are techniques that have been banned from being taught or used. \n",
            "This ban could have been put in place for any number of reasons, but kinjutsu can generally be put in one of three categories: \n",
            "Despite being banned, the mere use of these techniques generally does not carry any legal consequences in respects to the village they're used in, except those brought on by the techniques themselves. However, their use is heavily frowned upon, especially those techniques that violate nature. On the other hand, researching on and creating kinjutsu are punishable, as Orochimaru and Hiruko were both forced to flee Konohagakure after being caught using live people as guinea pigs, while Deidara was forced to leave Iwagakure when he stole a kinjutsu to develop his passion for art.\n"
        ]
    },
    {
        "href": "/wiki/Medical_Ninjutsu",
        "title": "Medical Ninjutsu",
        "data": [
            "Medical Ninjutsu (医療忍術, Iryō Ninjutsu, Literally meaning: Medical Ninja Techniques) is a branch of ninjutsu associated with healing, as well as the manipulation of their own, or another's body, practised by shinobi categorised as \"medical-nin\". The use of medical ninjutsu requires very advanced chakra control, as well as extensive knowledge on such things as herbs, medicines, the human body and even poisons.\n",
            "The knowledge of medical ninjutsu can be used for a variety of purposes apart from simply healing. It can be used to create poisonous gas, deranging the target's nervous system, or directly attacking a target with chakra scalpels. Tsunade, renowned as the greatest medical-nin in the world, was able to apply the extreme chakra control required for medical ninjutsu to create chakra-enhanced strength, an ability she taught to her student, Sakura Haruno. \n"
        ]
    },
    {
        "href": "/wiki/Ninjutsu",
        "title": "Ninjutsu",
        "data": [
            "Ninjutsu (忍術, English TV: Ninja Art, Literally meaning: Ninja Techniques) is one of the three main jutsu categories. Ninjutsu is the most nebulous of the three, and may most simply be described as anything that is not genjutsu or taijutsu. Most ninjutsu require chakra and hand seals, but this is not always the case since the mere usage of weaponry qualifies as ninjutsu. The huge range of ninjutsu's uses is illustrated by its several sub-classifications: medical ninjutsu, reincarnation ninjutsu, space–time ninjutsu, barrier ninjutsu, sealing jutsu, and cursed seal jutsu.\n",
            "Most ninjutsu use shape transformation, which deals with controlling the form and movement of the ninjutsu, while nature transformation deals with changing the ninjutsu's physical properties. Ninjutsu that use nature transformation tend to follow a naming convention of their nature type followed by a more specific name. With practice and experience, certain ninjutsu can become second nature to a ninja, allowing them to perform it at will.\n",
            "Ninjutsu is human's corrupted use of the Sage of the Six Paths' ninshū originally created by his son, Indra;[1] rather than use chakra to achieve understanding and create peace as the Sage intended, humans weaponised their chakra for war. Over time, shinobi came to believe that Hagoromo was the inventor of the ninjutsu rather than his eldest son.\n"
        ]
    },
    {
        "href": "/wiki/Ninsh%C5%AB",
        "title": "Ninshū",
        "data": [
            "Ninshū (忍宗, Viz: Ninja Creed, Literally meaning: Shinobi Sect) is the religion and the peaceful precursor of modern ninjutsu created by Hagoromo Ōtsutsuki, the first one to understand and teach the mystery of chakra. The teachings of ninshū were meant to give people a better understanding of themselves, as well as others, and lead the world into an era of peace. Ninshū would eventually come to be known as ninjutsu, a more weaponised version of the Sage's teachings.\n",
            "Hagoromo exemplified his teachings by distributing chakra meant to \"connect\" people's spiritual energies with one another. It would allow people to understand each other without communication and pray for one another's safety. After being passed over as the successor of ninshū over his brother, and subsequently manipulated by Black Zetsu, Indra Ōtsutsuki was the first to weaponise it into ninjutsu.[1] Others followed his footsteps, using chakra to connect their inner spiritual and physical energies together instead of each other. It was Hagoromo's belief that no one's chakra should be so much greater than any other. If the power is accumulated into one person, then it increases the possibility that the person will become arrogant and desire even greater power. In the end, they ended up using their chakra in battle, just as Hagoromo's mother Kaguya did.\n"
        ]
    },
    {
        "href": "/wiki/Nintaijutsu",
        "title": "Nintaijutsu",
        "data": [
            "Nintaijutsu (忍体術, Literally meaning: Ninja Body Techniques)[1] is a term used to describe the fighting style that incorporates the use of ninjutsu and taijutsu. This fighting style is most prominent in Kumogakure,[1] with the Third[2] and Fourth Raikage being its foremost users. By surrounding themselves in their Lightning Release Chakra Mode, the two's strength, durability, speed, and reflexes are augmented to an exceptional degree.\n"
        ]
    },
    {
        "href": "/wiki/Regeneration_Techniques",
        "title": "Regeneration Techniques",
        "data": [
            "Regeneration Techniques (再生術, Saiseijutsu) are ninjutsu that allows the user to heal their bodies from damage incurred. Depending on the strength of the techniques, some may be even powerful enough to purge the body of poison.[1] Some regeneration techniques may be an application of medical ninjutsu onto the user's own bodies, while others may be gathering a huge amount of chakra to repair the body.[2]\n",
            "A potential drawback to regeneration techniques is that the body's cells are limited to how many times they can divide themselves in one's lifetime, and by accelerating that division to recreate lost limbs and organs, one is basically shortening their lifespan.[3] Certain techniques of extreme destructive power, such as the True Fire of Samadhi[4] and Destruction Beam[5] are capable of overwhelming regeneration techniques.\n",
            "Some regeneration techniques can be used to extend one's lifespan,[6] but this cannot be indefinite, as it would eventually reach a limit, and the body would succumb to senescence.[7]\n",
            "The cells of Hashirama Senju possess an immense Regeneration Ability that requires no hand seals.[8][9] Once Madara Uchiha acquired this power, along with becoming the Jinchūriki of the Ten-Tails, he elevated this regenerative power to the point of a form of \"immortality\",[10] able to survive even from bisection at his waist.[11]\n"
        ]
    },
    {
        "href": "/wiki/Reincarnation_Ninjutsu",
        "title": "Reincarnation Ninjutsu",
        "data": [
            "Reincarnation Ninjutsu (転生忍術, Tensei Ninjutsu, Literally meaning: Life Transfer Ninja Techniques\" or \"Reincarnation Ninja Techniques) are techniques that usually require or accomplish the transfer of life force between people. These techniques are generally classified as kinjutsu because the restoration of one life typically requires the sacrifice of the life of another, or that it violates the laws of nature and morality.\n"
        ]
    },
    {
        "href": "/wiki/Senjutsu",
        "title": "Senjutsu",
        "data": [
            "Senjutsu (仙術, English TV: Sage Jutsu, Literally meaning: Sage Techniques) are a specialised field of jutsu that involve the use of natural energy. Senjutsu practitioners, known as sages, learn to draw natural energy inside their bodies, blending it with their own chakra to create senjutsu chakra (仙術チャクラ, senjutsu chakura, English TV: Sage Jutsu Chakra). This chakra adds a new dimension of power to the user's techniques, while also allowing for the use of techniques that would not otherwise be possible.\n",
            "Senjutsu is known to be taught at two locations: Mount Myōboku and Ryūchi Cave. To use senjutsu, one must first learn to sense the natural energy in their surroundings and gather it inside their body. It must then be balanced with the user's own physical and spiritual energies, which make up their chakra, to create senjutsu chakra. If too little natural energy is added to the mix, senjutsu cannot be used, but gathering too much results in the user turning to stone. In the case of humans, absorbing too much natural energy first causes them to transform into an animal, be it a toad for practitioners at Mount Myōboku or a snake for practitioners at Ryūchi Cave. This process can be reversed if the natural energy is expelled from the person's body before they fully transform, but once the transformation is complete, it becomes permanent.[1][2]\n",
            "Those who are successful in this training learn to enter a state called Sage Mode, in which their physical parameters and sensing capabilities are dramatically enhanced for as long as the mode is active. Though trainees seem to enter Sage Mode automatically during the learning process, it is possible to create senjutsu chakra without entering Sage Mode in order to store it for later.[3][4] Whereas the use of ninjutsu exhausts the user due to expending their chakra, senjutsu takes in natural energy from the outside, and thus causes the user to recover more quickly instead.[5] However, senjutsu can only be used by those who already possess an enormous amount of chakra, as otherwise the natural energy would immediately overwhelm them.[6] Techniques made using senjutsu chakra cannot be nullified by Truth-Seeking Balls, and are also capable of harming the Ten-Tails' jinchūriki, whose body is immune to ninjutsu.[7]\n",
            "Generally, senjutsu can only by used by those who undergo extensive training, though there are methods of obtaining senjutsu chakra through other means:\n",
            "In the anime, the toads of Mount Myōboku are shown to have been using an ability called Sage Power (仙力, Senriki) since long before Hagoromo spread chakra among Earth's inhabitants. By gathering natural energy into their bodies, they were able to drastically increase their strength, as well as shoot jets of water from their mouths in a manner similar to Water Release techniques. Despite these ancient practitioners having no chakra with which to balance the natural energy they absorbed, using sage power appears to have carried similar risks to using senjutsu, as indicated by the petrified remains of those who failed to control it being present at the mountain. The toad Gamamaru eventually taught Hagoromo to use sage power, making him the first person to use senjutsu in its modern form.[13]\n"
        ]
    },
    {
        "href": "/wiki/Shurikenjutsu",
        "title": "Shurikenjutsu",
        "data": [
            "Shurikenjutsu (手裏剣術, Literally meaning: concealed hand blade techniques) pertains to techniques that entail the throwing of shuriken, kunai, senbon, or any other number of bladed, hand-held weapons. Shurikenjutsu can be used in combination with taijutsu, ninjutsu, and/or chakra flow in order to create more devastating techniques. Additionally, shurikenjutsu can pertain to techniques used through ninjutsu-made weapons.\n",
            "As a consequence of the versatility of the weapons involved, it is practised by nearly all shinobi to some extent. However, because of its value as a supplemental art, numerous more innovative techniques have been developed, including ones that can even alter the trajectory of the projectiles once they've be thrown. Expert users like Itachi Uchiha, can use such methods to accurately hit targets that are even located in their blind spots. Shurikenjutsu becomes a specialty for Itachi's brother, Sasuke, as well for Sasuke's daughter, Sarada.\n"
        ]
    },
    {
        "href": "/wiki/Space%E2%80%93Time_Ninjutsu",
        "title": "Space–Time Ninjutsu",
        "data": [
            "Space–Time Ninjutsu (時空間忍術, Jikūkan Ninjutsu, English TV: \"Teleportation Ninjutsu\" or \"Transportation Techniques\", Literally meaning: Space–Time Ninja Techniques)[1] are techniques that allow the users to manipulate the space–time continuum.\n",
            "By manipulating a specific point of space, the user can warp anything targeted into a dimensional void and teleport it to another location instantaneously. Tobirama Senju, Minato Namikaze and Obito Uchiha are all notably skilled users of space–time ninjutsu for example. Space-time techniques are not common, as Shikamaru noted its rarity.[2]\n",
            "All summoning-based techniques are space–time related, as they warp the targets through a dimensional void to the summoner's location.[1]\n",
            "Space–Time Ninjutsu allows one to bypass any Barrier Ninjutsu, as barriers only extend over the dimension they are placed upon, and similarly cannot prevent Space–Time Ninjutsu users from escaping to a dimensional void and then back outside of the barrier's confines.[3][4][5]\n",
            "It appears that each specific space-time technique has its own unique dimensional void that other techniques cannot normally access,[6] however, a skilled user can synchronise their respective dimension with another to gain access to it - a feat which requires an enormous amount of chakra; directly proportional to the distance between the dimensions.[7] Obito for example, despite his ability to use Kamui countless times in a single day without noticeable effects on his chakra reserves struggled to open a portal to one of Kaguya's dimension for even a few seconds. While Kaguya's immense chakra reserves enabled her to connect her dimensions instantly,[8] Black Zetsu noted that repeated use would take a toll on her chakra reserves.[9]\n"
        ]
    },
    {
        "href": "/wiki/Taijutsu",
        "title": "Taijutsu",
        "data": [
            "Taijutsu (体術, Literally meaning: Body Techniques) is a basic form of techniques and refers to any techniques involving the martial arts or the optimisation of natural human abilities. Taijutsu is executed by directly accessing the user's physical and mental energies, relying on the stamina and strength gained through training. It typically does not require chakra, though chakra may be used to enhance its techniques. Taijutsu generally requires no hand seals to perform, occasionally making use of certain stances or poses, and are far quicker to use than ninjutsu or genjutsu. Taijutsu is, simply put, hand-to-hand combat.\n",
            "Although it is used by nearly all ninja, only a few of them use it as their primary fighting style like Rock Lee and his teacher Might Guy for example, who are experts of many taijutsu techniques. Example of taijutsu techniques are Dynamic Entry and Leaf Whirlwind. The Hyūga clan's Gentle Fist, however, makes extensive use of chakra and demands great skill in its control. The taijutsu techniques are the right choices for those that want to save their time and chakra, or for those who rely on their physical attributes. It can also be used uniquely in collaboration with ninjutsu to create nintaijutsu techniques. The Shikotsumyaku is said to be the ultimate taijutsu ability, due to the produced bones can be used to augment offensive and defensive powers in versatile ways. Killer B's unique style of taijutsu combined with kenjutsu is called Disturbance Taijutsu (攪乱体術, Kakuran Taijutsu, Literally meaning: Disturbance Body Technique) and used through Acrobat.\n"
        ]
    }
]